### 1. 페이지뷰 데이터 불러오기
- ATHENA 프로그램을 통해 다운받기
- 데이터 내용 : 클릭된 모든 기사별 페이지뷰 
- 기간 : 7월
- 퍼블리셔 : 파트너스
- 카테고리 : CA0517

In [14]:
import pandas as pd
df = pd.DataFrame(result_set)

In [16]:
df.head()

   0       1     2        3  4  5    6
0  1      CA     0     기사분류  N  Y  100
1  2    CA01    CA       뉴스  Y  Y  100
2  3  CA0101  CA01  뉴스 주요기사  N  Y  100
3  4  CA0102  CA01     정치일반  N  Y  100
4  5  CA0103  CA01     사회일반  N  Y  110

In [ ]:
with engine.connect() as connection:
    many_rows = Table("many_rows", MetaData(), autoload_with=connection)
    result = connection.execute(select([func.count("*")], from_obj=many_rows))
    print(result.scalar())

In [1]:
import pandas as pd
visit = pd.read_csv("p_visit_220810.csv")

In [2]:
visit.head()

                   nid   visit newcategory  rank
0  2022070114150156901  911232      CA0518     1
1  2022070517293105079  745429      CA0518     2
2  2022070800233678385  634591      CA0518     3
3  2022071211140288332  568974      CA0518     4
4  2022071219450119544  543328      CA0518     5

In [6]:
engine

Engine(awsathena+rest://AKIA3DRGI335I2LFTIVD:***@athena.ap-northeast-2.amazonaws.com:443/newspic-dw?s3_staging_dir=s3%3A%2F%2Fnotiplus-rds-backup%2Fathena_result%2Fstatistics%2F)

In [3]:
visit.head()

                   nid   visit newcategory  rank
0  2022070114150156901  911232      CA0518     1
1  2022070517293105079  745429      CA0518     2
2  2022070800233678385  634591      CA0518     3
3  2022071211140288332  568974      CA0518     4
4  2022071219450119544  543328      CA0518     5

In [4]:
visit.tail()

                       nid  visit newcategory   rank
76359  2022030115154139586      1      CA0518  48647
76360  2022062717111807108      1      CA0518  48647
76361  2022051918074229369      1      CA0518  48647
76362  2022042023150770555      1      CA0518  48647
76363  2022041809440155826      1      CA0518  48647

In [5]:
visit.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 76364 entries, 0 to 76363
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   nid          76364 non-null  int64
 1   visit        76364 non-null  int64
 2   newcategory  76364 non-null  object
 3   rank         76364 non-null  int64
dtypes: int64(3), object(1)
memory usage: 2.3+ MB

In [6]:
# 컬럼 'nid' 문자형으로 바꾸기
visit['nid']= visit['nid'].astype('str')

### 2. 클릭된 콘텐츠 키워드 데이터 가져오기

* 콘텐츠 데이터 : 6월~7월

In [7]:
# 기사 제목,nid 가져오기
import pymysql
connect = pymysql.connect(host='ec2-3-35-194-202.ap-northeast-2.compute.amazonaws.com'
                        , port = 3306
                        , user='newspic_read'
                        , password ='shxlvmffjtm1!'
                        , db = 'newspic'
                        , charset='utf8')
# connection으로부터 cursor 생성
cur = connect.cursor()
# 수집 뉴스 테이블 picNews 가져오기
query_news = '''
SELECT pn.author, pn.category, tc.category as newcategory, nc.codeName,nc.pcode, TW.*
FROM  picNews pn inner join tbContentsInfo tc on pn.nid= tc.nid
                 left join newsCate nc        ON tc.category = nc.code   
                 left JOIN tbNewsTitleWord TW ON pn.nid = TW.nid   
WHERE 1=1 
AND   pn.nid >= '2022060100000099999' 
AND   pn.nid <= '2022073123595999999'
AND   tc.category ='CA0518'
ORDER BY pn.pubDate DESC, pn.nid DESC
            '''
df_news = pd.read_sql(query_news, connect)
df_news = df_news[['nid','title','pcode','codeName','author','word','text_rank_word']]

In [8]:
vis_news = pd.merge(visit, df_news, on='nid')
vis_news.head()

,nid,visit,newcategory,rank,title,pcode,codeName,author,word,text_rank_word
0,2022070114150156901,911232,CA0518,1,19)못볼걸 본 핸드폰 매장 직원.blind,CA05,유머/이슈,시보드,핸드폰 매장 직원 블라인드,핸드폰 매장 직원 블라인드
1,2022070517293105079,745429,CA0518,2,그만둔지 1년된 알바생이 돈을 빌려달라고 한다,CA05,유머/이슈,사이다판,둔지 아르바이트생,둔지 아르바이트생
2,2022070800233678385,634591,CA0518,3,회식 누나,CA05,유머/이슈,레몬판,회식 누나,회식 누나
3,2022071211140288332,568974,CA0518,4,3개월만에 에이즈 걸린 썰.txt,CA05,유머/이슈,시보드,3개월만에 이즈 걸린 투모로우바이투게더,ㄷㄷ 3개월만에 이즈 걸린 투모로우바이투게더
4,2022071219450119544,543328,CA0518,5,디씨인의 보릉내 단계별 정리,CA05,유머/이슈,시보드,디씨인 단계 정리,디씨인 단계 정리

In [9]:
vis_news['date'] = vis_news['nid'].str[:8]

In [10]:
# 모든 행을 보고자할때 
vis_news.groupby('date').sum()

            visit      rank
date
20220601     6853   6391519
20220602    32351   5920212
20220603     5582   6130111
20220604     3922   4742904
20220605     8111   6394046
...           ...       ...
20220727  1704132  19766631
20220728  2626414  19232207
20220729  2284284  21979550
20220730  1404026  19034864
20220731   370615  22312467

[61 rows x 2 columns]

In [11]:
vis_news.head()

,nid,visit,newcategory,rank,title,pcode,codeName,author,word,text_rank_word,date
0,2022070114150156901,911232,CA0518,1,19)못볼걸 본 핸드폰 매장 직원.blind,CA05,유머/이슈,시보드,핸드폰 매장 직원 블라인드,핸드폰 매장 직원 블라인드,20220701
1,2022070517293105079,745429,CA0518,2,그만둔지 1년된 알바생이 돈을 빌려달라고 한다,CA05,유머/이슈,사이다판,둔지 아르바이트생,둔지 아르바이트생,20220705
2,2022070800233678385,634591,CA0518,3,회식 누나,CA05,유머/이슈,레몬판,회식 누나,회식 누나,20220708
3,2022071211140288332,568974,CA0518,4,3개월만에 에이즈 걸린 썰.txt,CA05,유머/이슈,시보드,3개월만에 이즈 걸린 투모로우바이투게더,ㄷㄷ 3개월만에 이즈 걸린 투모로우바이투게더,20220712
4,2022071219450119544,543328,CA0518,5,디씨인의 보릉내 단계별 정리,CA05,유머/이슈,시보드,디씨인 단계 정리,디씨인 단계 정리,20220712

In [12]:
# 키워드 행번호에 따라서 행렬화
wordlist = vis_news['word'].str.split(" ",expand=True)
wordlist2 = wordlist.stack().reset_index(level=1, drop=True).to_frame('keyword')

In [13]:
vis_news2 = vis_news.merge(wordlist2, left_index=True, right_index=True, how='left')

In [14]:
vis_news2.head()

,nid,visit,newcategory,rank,title,pcode,codeName,author,word,text_rank_word,date,keyword
0,2022070114150156901,911232,CA0518,1,19)못볼걸 본 핸드폰 매장 직원.blind,CA05,유머/이슈,시보드,핸드폰 매장 직원 블라인드,핸드폰 매장 직원 블라인드,20220701,핸드폰
0,2022070114150156901,911232,CA0518,1,19)못볼걸 본 핸드폰 매장 직원.blind,CA05,유머/이슈,시보드,핸드폰 매장 직원 블라인드,핸드폰 매장 직원 블라인드,20220701,매장
0,2022070114150156901,911232,CA0518,1,19)못볼걸 본 핸드폰 매장 직원.blind,CA05,유머/이슈,시보드,핸드폰 매장 직원 블라인드,핸드폰 매장 직원 블라인드,20220701,직원
0,2022070114150156901,911232,CA0518,1,19)못볼걸 본 핸드폰 매장 직원.blind,CA05,유머/이슈,시보드,핸드폰 매장 직원 블라인드,핸드폰 매장 직원 블라인드,20220701,블라인드
1,2022070517293105079,745429,CA0518,2,그만둔지 1년된 알바생이 돈을 빌려달라고 한다,CA05,유머/이슈,사이다판,둔지 아르바이트생,둔지 아르바이트생,20220705,둔지

In [15]:
vis_news2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 130437 entries, 0 to 36739
Data columns (total 12 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   nid             130437 non-null  object
 1   visit           130437 non-null  int64
 2   newcategory     130437 non-null  object
 3   rank            130437 non-null  int64
 4   title           130437 non-null  object
 5   pcode           130437 non-null  object
 6   codeName        130437 non-null  object
 7   author          130437 non-null  object
 8   word            130437 non-null  object
 9   text_rank_word  130437 non-null  object
 10  date            130437 non-null  object
 11  keyword         130437 non-null  object
dtypes: int64(2), object(10)
memory usage: 12.9+ MB

In [16]:
vis_news2.to_csv("파트너스_클릭기사리스트2_2207.csv", encoding='utf-8-sig')

#### 피봇1. 키워드 포함된 콘텐츠 페이지뷰

In [17]:
import numpy as np
# visit : 키워드 포함된 콘텐츠 페이지뷰
v_pivot = pd.pivot_table(vis_news2 , index='keyword',values='visit',aggfunc=np.sum).sort_values(by='visit', ascending=False)

In [18]:
v_pivot.head()

            visit
keyword
JPG      18918331
이유        5658057
레전드       3546741
일본        2798881
누나        2246498

In [19]:
v_pivot = v_pivot.reset_index()

#### 피봇2. 키워드 포함된 클릭된 콘텐츠 개수

In [20]:
# nid : 키워드 포함된 클릭된 콘텐츠 개수
n_pivot = vis_news2.groupby('keyword').count().sort_values(by='nid', ascending=False)

In [21]:
n_pivot =n_pivot[['nid']]

In [22]:
n_pivot.head()

          nid
keyword
JPG      6049
이유       2241
근황       1768
사람       1274
대한민국      979

In [23]:
n_pivot = n_pivot.reset_index()

### 3. 콘텐츠 키워드별 수집수 가져오기

* 콘텐츠 데이터 : 7월

In [24]:
# 기사 제목,nid 가져오기
import pymysql
connect = pymysql.connect(host='ec2-3-35-194-202.ap-northeast-2.compute.amazonaws.com'
                        , port = 3306
                        , user='newspic_read'
                        , password ='shxlvmffjtm1!'
                        , db = 'newspic'
                        , charset='utf8')
# connection으로부터 cursor 생성
cur = connect.cursor()
# 수집 뉴스 테이블 picNews 가져오기
query2 = '''
SELECT pn.author, pn.category, tc.category as newcategory, nc.codeName,nc.pcode, TW.*
FROM  picNews pn inner join tbContentsInfo tc on pn.nid= tc.nid
                 left join newsCate nc        ON tc.category = nc.code   
                 left JOIN tbNewsTitleWord TW ON pn.nid = TW.nid   
WHERE 1=1 
AND   pn.nid >= '2022070100000099999' 
AND   pn.nid <= '2022073123595999999'
AND   tc.category ='CA0518'
ORDER BY pn.pubDate DESC, pn.nid DESC
            '''
news = pd.read_sql(query2, connect)
news = news[['nid','title','pcode','codeName','author','word','text_rank_word']]

####  피봇3.  키워드별 수집수 컬럼 생성

In [25]:
news.tail()

,nid,title,pcode,codeName,author,word,text_rank_word
53452,2022070100003175643,훈련소 레전드 쾌변 요법,CA05,유머/이슈,피드클릭,훈련소 레전드 쾌변 요법,훈련소 레전드 쾌변 요법
53453,2022070100000228899,호텔같은 나의 오션뷰 세컨드 하우스,CA05,유머/이슈,엘르,호텔 오션뷰 세컨드 하우스,세컨드 하우스 거실 효정 회사원
53454,2022070100000148691,흔한 영화 편집 안된 감독판 진짜 대사甲.,CA05,유머/이슈,사이다판,영화 편집 감독판 대사,영화 편집 감독판 대사
53455,2022070100000147590,새로운 유형의 주문요청,CA05,유머/이슈,사이다판,유형 주문 요청,유형 주문 요청
53456,2022070100000136522,지금 집이 불타는 게 문제냐,CA05,유머/이슈,사이다판,트러블,와중 트러블

In [26]:
news.count()

nid               52604
title             52604
pcode             53457
codeName          53457
author            53457
word              52604
text_rank_word    52604
dtype: int64

In [27]:
# 키워드 행번호에 따라서 행렬화
n_wordlist = news['word'].str.split(" ",expand=True)
n_wordlist2 = n_wordlist.stack().reset_index(level=1, drop=True).to_frame('keyword')

In [28]:
n_wordlist2

      keyword
32         학식
32         동린
32         하노
32        여행기
32         트립
...       ...
53454      대사
53455      유형
53455      주문
53455      요청
53456     트러블

[184609 rows x 1 columns]

In [29]:
news2 = df_news.merge(n_wordlist2, left_index=True, right_index=True, how='left')

In [30]:
# 키워드에 따른 수집수컬럼 구하기
nid_pivot = news2.groupby('keyword').count().sort_values(by='nid', ascending=False)

In [31]:
nid_pivot =nid_pivot[['nid']]
nid_pivot = nid_pivot.reset_index()

In [32]:
nid_pivot

      keyword   nid
0         JPG  8329
1          이유  3084
2          근황  2425
3          사람  1764
4        대한민국  1599
...       ...   ...
18724     의료비     1
18725      마미     1
18726    마법소녀     1
18727      의령     1
18728     힙합씬     1

[18729 rows x 2 columns]

In [33]:
news2[news2['keyword']=='근황']

,nid,title,pcode,codeName,author,word,text_rank_word,keyword
39,2022073123250151990,앙기모찌 초딩 근황,CA05,유머/이슈,이슈야,앙기 모찌 초딩 근황,앙기 모찌 초딩 근황,근황
65,2022073123150147884,곧 바빠질 전국의 편의점 근황.JPG,CA05,유머/이슈,시보드,전국 편의점 근황 JPG,전국 편의점 근황 JPG,근황
84,2022073122505803851,속보)6호 태풍 근황 제주로 직진.news,CA05,유머/이슈,엠봉,속보 태풍 근황 제주 직진,속보 태풍 근황 제주 직진,근황
101,2022073122434892640,아이린 세탁 예능 근황,CA05,유머/이슈,레몬판,아이린 세탁 예능 근황,스태프 아이린 리고 만들러 짐차,근황
103,2022073122413658977,벌크업한 유아인 근황,CA05,유머/이슈,레몬판,벌크업 유아인 근황,벌크업 유아인 근황,근황
...,...,...,...,...,...,...,...,...
53392,2022070100361648363,쏟아지는 폭우.. 오늘자 탄천 근황,CA05,유머/이슈,이슈야,폭우 탄천 근황,폭우 오늘 자탄 근황 탄천,근황
53410,2022070100074652989,벌크업한 김하온 근황,CA05,유머/이슈,움짤모아,벌크업 김하온 근황,벌크업 래퍼 사일러스됨 고딩 김하온,근황
53440,2022070100010227074,요즘 소아과 근황,CA05,유머/이슈,유머픽,요즘 소아 근황,요즘 소아 근황,근황
53443,2022070100010224590,우에하라 아이 근황,CA05,유머/이슈,유머픽,우에하라 아이 근황,신법 우에하라 아이 반대 본인,근황
53450,2022070100010210686,스압) 에타에서 난리났던 부산대 감자녀 사건 근황.jpg,CA05,유머/이슈,유머픽,스압 에타 폭동 부산대 사건 근황 JPG,감자 박스 스압 에타 폭동,근황

### 3. 피봇 3개 합치기

In [34]:
f_pivot =pd.merge(v_pivot, n_pivot,on='keyword')

In [35]:
f_pivot

      keyword     visit   nid
0         JPG  18918331  6049
1          이유   5658057  2241
2         레전드   3546741   740
3          일본   2798881   874
4          누나   2246498   230
...       ...       ...   ...
17398      연료         1     1
17399     연구회         1     1
17400      베스         1     1
17401     노키즈         1     1
17402     무근본         1     1

[17403 rows x 3 columns]

In [36]:
f2_pivot =pd.merge(f_pivot, nid_pivot, on='keyword')

In [37]:
f2_pivot.head()

  keyword     visit  nid_x  nid_y
0     JPG  18918331   6049   8329
1      이유   5658057   2241   3084
2     레전드   3546741    740    863
3      일본   2798881    874   1258
4      누나   2246498    230    274

In [38]:
f2_pivot.to_csv("파트너스키워드별통계2_2207.csv", encoding='utf-8-sig')